_Rarzrabotki/Rarus/USO2/Documents/УПН_РаспределениеОплатИРасчетовПоОбъектамНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РаспределениеОплатИРасчетовПоОбъектамНедвижимости</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеБезналичныхДенежныхСредств</xr:Item>
				<xr:Item>Document.ПоступлениеДенежныхДокументов</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьУжеОплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьУжеОплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СоответствиеДоговоровИДолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СоответствиеДоговоровИДолей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расторгнут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_СтатусыДокументовПоСделке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Доля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/АналитикаУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаПоПартнерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УПН_РасчетыСКлиентамиПоОбъектамНедвижимости</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РасторжениеСделкиПоНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РасторжениеСделкиПоНедвижимости</Name>
			<BasedOn>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости</xr:Item>
				<xr:Item>InformationRegister.УСОERP_СоответствиеДоговоровИДолей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_СтатусыДокументовПоСделке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоНедвижимости</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УПН_ДоговорПоНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРасторжения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозврата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Санкции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РаспределениеОплатИРасчетовПоОбъектамНедвижимости/Forms/УСОERP_ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ОтветПередЗаписью;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительно");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииСервер();
	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ДокументОснованиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКонтрагенту(Команда)
	
	Если Не Параметры.Ключ.Пустая() И Объект.Проведен Тогда
		ПоказатьПредупреждение(, "Для заполнения документа необходимо отменить проведение!");
		Возврат;
		
	Иначе
		Если Объект.РасшифровкаПлатежа.Количество() Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоКонтрагентуПродолжение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
			
		Иначе
			ЗаполнитьПоКонтрагентуПродолжение(КодВозвратаДиалога.Да, Новый Структура);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКонтрагентуПродолжение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоКонтрагентуНаСервере();
	
КонецПроцедуры  

&НаКлиенте
Процедура РаспределитьПоПлощади(Команда)
	
	РаспределитьСуммуОснованияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоСтоимости(Команда)
	
	РаспределитьСуммуОснованияНаСервере("ОбщаяСтоимость");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТаблицы = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		ПолучитьПартнераПоУмолчаниюСервер(Объект.Контрагент, Партнер);
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		Если ЗначениеЗаполнено(Партнер) Тогда
			СтрокаТаблицы.Партнер = Партнер;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			СтрокаТаблицы.Договор = ДоговорКонтрагента;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;

	ТекДанные.Площадь = ТекДанные.ОбщаяПлощадь * ?(ТекДанные.ОбщаяСтоимость = 0, 0, ТекДанные.Сумма / ТекДанные.ОбщаяСтоимость);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПлощадьПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Цена = ?(ТекДанные.ОбщаяПлощадь = 0, 0, ТекДанные.ОбщаяСтоимость / ТекДанные.ОбщаяПлощадь);
	
	ТекДанные.Сумма = Цена * ТекДанные.Площадь;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаОбщаяСтоимостьПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Цена = ?(ТекДанные.ОбщаяПлощадь = 0, 0, ТекДанные.ОбщаяСтоимость / ТекДанные.ОбщаяПлощадь);
	
	ТекДанные.Сумма = Цена * ТекДанные.Площадь;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаОбщаяПлощадьПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Цена = ?(ТекДанные.ОбщаяПлощадь = 0, 0, ТекДанные.ОбщаяСтоимость / ТекДанные.ОбщаяПлощадь);
	
	ТекДанные.Сумма = Цена * ТекДанные.Площадь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура КонтрагентПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Партнер = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(Объект.Контрагент);
		Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТЧ.Партнер = Партнер;
		КонецЦикла;
		
		ПолучитьДоговорПоУмолчаниюСервер();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ПолучитьДоговорПоУмолчаниюСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	
	ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Валюта");
	Если Объект.Валюта <> ВалютаДоговора Тогда
		Объект.Валюта = ВалютаДоговора;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	УстановитьВидимость();
	УстановитьОтметкуНезаполненного();
	//Элементы.Валюта.Заголовок = Строка(Объект.Валюта);
	
	ПолучитьДоговорПоУмолчаниюСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкуНезаполненного()
	
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ПолучитьПартнераПоУмолчаниюСервер(Объект.Контрагент, Партнер);
	ПолучитьДоговорПоУмолчаниюСервер();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДоговорПоУмолчаниюСервер()
	
	ХозяйственнаяОперацияДоговора = Новый Массив;
	
	ДоговорКонтрагента = ДенежныеСредстваСервер.ДоговорПоУмолчанию(
		ДоговорКонтрагента,
		Партнер,
		Объект.Контрагент,
		Объект.Организация,
		Неопределено);//ХозяйственнаяОперацияДоговора);
		
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьПартнераПоУмолчаниюСервер(Контрагент, Партнер)
	
	Партнер = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(Контрагент);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоКонтрагентуНаСервере()
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	Если НЕ (ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Организация)) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Регистратор ССЫЛКА Документ.УПН_ДоговорПоНедвижимости
	|			ТОГДА УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Регистратор.Партнер
	|		КОГДА УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Регистратор ССЫЛКА Документ.УПН_РасторжениеСделкиПоНедвижимости
	|			ТОГДА УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Регистратор.Партнер
	|	КОНЕЦ КАК Партнер,
	|	УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Договор КАК Договор,
	|	УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Доля КАК ОбъектНедвижимости,
	|	УСОERP_СоответствиеДоговоровИДолейСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Сумма КАК ОбщаяСтоимость
	|ПОМЕСТИТЬ ДанныеПоДолям
	|ИЗ
	|	РегистрСведений.УСОERP_СоответствиеДоговоровИДолей.СрезПоследних(&ДатаЗаполнения, ) КАК УСОERP_СоответствиеДоговоровИДолейСрезПоследних
	|ГДЕ
	|	НЕ УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Расторгнут
	|	И УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Контрагент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоДолям.Партнер КАК Партнер,
	|	ДанныеПоДолям.Договор КАК Договор,
	|	ДанныеПоДолям.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	ДанныеПоДолям.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ДанныеПоДолям.ОбщаяСтоимость КАК ОбщаяСтоимость
	|ПОМЕСТИТЬ ДанныеПоДолямСАналитикойПоПартнерам
	|ИЗ
	|	ДанныеПоДолям КАК ДанныеПоДолям
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО (&Организация = Аналитика.Организация)
	|			И (&Контрагент = Аналитика.Контрагент)
	|			И ДанныеПоДолям.Партнер = Аналитика.Партнер
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКОнтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДанныеПоДолям.Договор = &Договор
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.АналитикаУчетаПоПартнерам.Партнер КАК АналитикаУчетаПоПартнерам,
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.Договор КАК Договор,
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	СУММА(УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.ПлощадьОстаток) КАК ПлощадьОстаток
	|ПОМЕСТИТЬ ДанныеОстаткаСтоимости
	|ИЗ
	|	РегистрНакопления.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Остатки(
	|			&ДатаЗаполнения,
	|			(Договор, ОбъектНедвижимости) В
	|					(ВЫБРАТЬ
	|						ДанныеПоДолям.Договор,
	|						ДанныеПоДолям.ОбъектНедвижимости
	|					ИЗ
	|						ДанныеПоДолям КАК ДанныеПоДолям)
	|				И АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.Договор = &Договор
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.АналитикаУчетаПоПартнерам.Партнер,
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.Договор,
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОстатки.ОбъектНедвижимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоДолямСАналитикойПоПартнерам.Партнер КАК Партнер,
	|	ДанныеПоДолямСАналитикойПоПартнерам.Договор КАК Договор,
	|	ДанныеПоДолямСАналитикойПоПартнерам.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	ДанныеПоДолямСАналитикойПоПартнерам.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ДанныеПоДолямСАналитикойПоПартнерам.ОбщаяСтоимость КАК ОбщаяСтоимость,
	|	ДанныеПоДолямСАналитикойПоПартнерам.ОбщаяПлощадь - ЕСТЬNULL(ДанныеОстаткаСтоимости.ПлощадьОстаток, 0) КАК ПлощадьУжеОплачено,
	|	ДанныеПоДолямСАналитикойПоПартнерам.ОбщаяСтоимость - ЕСТЬNULL(ДанныеОстаткаСтоимости.СуммаОстаток, 0) КАК СтоимостьУжеОплачено
	|ИЗ
	|	ДанныеПоДолям КАК ДанныеПоДолямСАналитикойПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОстаткаСтоимости КАК ДанныеОстаткаСтоимости
	|		ПО ДанныеПоДолямСАналитикойПоПартнерам.Договор = ДанныеОстаткаСтоимости.Договор
	|			И ДанныеПоДолямСАналитикойПоПартнерам.ОбъектНедвижимости = ДанныеОстаткаСтоимости.ОбъектНедвижимости
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДанныеОстаткаСтоимости.Договор = &Договор
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДанныеПоДолямСАналитикойПоПартнерам.Договор = &Договор
	|		КОНЕЦ";
	
	ДатаЗаполнения = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Новый Граница(Объект.Дата,ВидГраницы.Исключая));
	
	Запрос.УстановитьПараметр("ДатаЗаполнения", ДатаЗаполнения);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Договор",Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") И
		Объект.ДокументОснование.РасшифровкаПлатежа.Количество() И
		ТипЗнч(Объект.ДокументОснование.РасшифровкаПлатежа.Получить(0).Заказ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Запрос.УстановитьПараметр("Договор",Объект.ДокументОснование.РасшифровкаПлатежа.Получить(0).Заказ);
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьСуммуОснованияНаСервере(ИмяРеквизитаБазыРаспределения = "ОбщаяПлощадь")
	
	ТаблицаРасшифровкиПлатежа = Объект.РасшифровкаПлатежа.Выгрузить();
	
	СуммаДокументаОснования = УСОERP_ОбработкаТабличныхЧастей.ПолучитьСуммуОснованияДляРаспределенияОплатПоОбъектамНедвижимости(Объект.ДокументОснование, Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СуммаДокументаОснования = СуммаДокументаОснования+Объект.ДокументОснование.СуммаДокумента;
	КонецЕсли;
	
	ОсталосьРаспределить    = СуммаДокументаОснования;
	БазаРаспределения       = ТаблицаРасшифровкиПлатежа.Итог(ИмяРеквизитаБазыРаспределения);
	КоличествоСтрок         = ТаблицаРасшифровкиПлатежа.Количество();
	
	Если БазаРаспределения = 0 Тогда
		ТаблицаРасшифровкиПлатежа.ЗаполнитьЗначения(0, "Сумма, Площадь");
		Возврат;
	КонецЕсли;
	
	Сч = 0;
	Пока Сч < КоличествоСтрок Цикл
		
		СтрокаРасшифровки = ТаблицаРасшифровкиПлатежа[Сч];
		
		Если Сч = КоличествоСтрок - 1 Тогда // последняя строка
			СтрокаРасшифровки.Сумма = ОсталосьРаспределить;
		Иначе
			Коэффициент = СтрокаРасшифровки[ИмяРеквизитаБазыРаспределения] / БазаРаспределения;
			СтрокаРасшифровки.Сумма = СуммаДокументаОснования * Коэффициент;
		КонецЕсли;
		
		СтрокаРасшифровки.Площадь = СтрокаРасшифровки.ОбщаяПлощадь * ?(СтрокаРасшифровки.ОбщаяСтоимость = 0, 0, СтрокаРасшифровки.Сумма / СтрокаРасшифровки.ОбщаяСтоимость);
		
		ОсталосьРаспределить = ОсталосьРаспределить - СтрокаРасшифровки.Сумма;
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	Объект.РасшифровкаПлатежа.Загрузить(ТаблицаРасшифровкиПлатежа);
	
КонецПроцедуры


ОтветПередЗаписью = Ложь;

#КонецОбласти
